import {SelectTranslate} from "../../type";


const translates: SelectTranslate = {
    info: {
        ua: {
            work: 'Працюємо щодня, з',
            title: 'Меблева фабрика "Verona"',
        },
        ru: {
            work: 'Работаем каждый день, с',
            title: 'Мебельная фабрика "Verona"',
        },
        de: {}
    },
    header: {
        ua: {
            from: 'Меблі від виробника',
            work: 'Працюємо щодня з',
        },
        ru: {
            from: 'Мебель от производителя',
            work: 'Работаем каждый день, с',
        },
    },
    footer: {
        ua: {
            title: 'Меблева фабрика Verona',
            security: 'Всі права захищені.',
        },
        ru: {
            title: 'Мебельная фабрика Verona',
            security: 'Все права защищены.',
        }
    },
    catalogFurniture: {
        ua: {
            title: 'Каталог меблів',
            btnGo: 'Перейти',
        },
        ru: {
            title: 'Каталог мебели',
            btnGo: 'Перейти',
        }
    },
    callbackContacts: {
        ua: {
            whyWe: 'Чому ми?',
            exampleWork: 'Зразок наших робіт',
            contacts: 'Зв\'яжися із нами',
            video: 'Відео',
        },
        ru: {
            whyWe: 'Почему мы?',
            exampleWork: 'Образец наших работ',
            contacts: 'Свяжись с нами',
            video: 'Видео',
        }
    },
    callBack: {
        ua: {
            orderCallBack: 'Замовити зворотній дзвінок',
            yourName: 'Ваше Імʼя',
            yourNumber: 'Номер телефону',
            callBackMe: 'Передзвоніть мені',
            callBack: 'Зворотній виклик',
            sentSuccessfully: 'Ваше звернення було відправлено. Найближчим часом ми вам перетелефонуємо.',
            sentNotSuccessfully: 'Під час відправлення сталася помилка. Спробуйте пізніше.',
        },
        ru: {
            orderCallBack: 'Заказать обратный звонок',
            yourName: 'Ваше Имя',
            yourNumber: 'Номер телефона',
            callBackMe: 'Перезвоните мне',
            callBack: 'Обратный вызов',
            sentSuccessfully: 'Ваше обращение было отправлено. В ближайшее время мы вам перезвоним.',
            sentNotSuccessfully: 'Во время отправки произошла ошибка. Попробуйте позже.',
        }
    },
    helperSelect: {
        ua: {
            title: 'Розрахуйте, скільки коштуватиме кухня.',
            subTitle: 'Вкажіть параметри, щоб фахівець зміг заздалегідь запропонувати вам кілька варіантів та зорієнтувати за ціною',
            selectFromListBelow: 'Виберіть зі списку нижче, що вам подобається і натисніть кнопку внизу',
            fillInField: 'Заповніть поля даними та натисніть кнопку внизу',
            sentTitle: 'Допомога із вибором кухні',
            sentSuccessfully: 'Ваша заявка була успішно відправлена на обробку!\nНевідовзі з вами зв\'яжуться.',
            sentNotSuccessfully: 'Під час відправлення сталася помилка. Спробуйте пізніше.',
            btnPreview: 'Назад',
            btnNext: 'Вперед',
            bntFinal: 'Завершити',
        },
        ru: {
            title: 'Рассчитайте, сколько будет стоить кухня.',
            subTitle: 'Укажите параметры, чтобы специалист смог заранее предложить вам несколько вариантов и сориентировать по цене',
            selectFromListBelow: 'Выберите из списка ниже, что вам нравится и нажмите кнопку внизу',
            fillInField: 'Заполните поля данными и нажмите кнопку внизу',
            sentTitle: 'Помощь с выбором кухни',
            sentSuccessfully: 'Ваша заявка была успешно отправлена на обработку!\nВскоре с вами свяжутся.',
            sentNotSuccessfully: 'Во время отправки произошла ошибка. Попробуйте позже.',
            btnPreview: 'Обратно',
            btnNext: 'Вперед',
            bntFinal: 'Завершить',
        }
    },
    ourWorks: {
        ua: {
            title: 'Наші роботи',
            btnMore: 'Показати більше',
        },
        ru: {
            title: 'Наши работы',
            btnMore: 'Показать больше',
        }
    },

    pageHome: {
        ua: {
            title: 'Салон меблів',
            subTitle: 'Купуючи у виробника, Ви економите до 40% на вартості меблів.',
        },
        ru: {
            title: 'Салон мебели',
            subTitle: 'Покупая у производителя, вы экономите до 40% на стоимости мебели.',
        }
    },
    pageKitchenModern: {
        ua: {
            title: 'Кухні в стилі модерн',
        },
        ru: {
            title: 'Кухни в стиле модерн',
        },
    },
    pageKitchenNaturalWood: {
        ua: {
            title: 'Кухні із натурального дерева',
        }, ru: {
            title: 'Кухни из натурального дерева',
        },
    },
    pageKitchenProfileMDF: {
        ua: {
            title: 'Кухні із профільного МДФ',
        }, ru: {
            title: 'Кухни из профильного МДФ',
        },
    },
    pageMdfKitchens: {
        ua: {
            title: 'Кухні МДФ із фрезеруванням',
        }, ru: {
            title: 'Кухни МДФ с фрезерованием',
        },
    }, pageWardrobesClassic: {
        ua: {
            title: 'Шафи Класика',
        },
        ru: {
            title: 'Шкафы Классика',
        },
    }, pageWardrobesModern: {
        ua: {
            title: 'Шафи Модерн',
        }, ru: {
            title: 'Шкафы Модерн',
        },
    }, pageNotFound: {
        ua: {
            title: 'Сторінку не знайдено 404',
        }, ru: {
            title: 'Страница не найдена 404',
        },
    },

};


export default translates;